Revit 2027 API
ExternalEventRequest Enumeration
 Represents the possible outcomes of a request for raising an external event.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ExternalEventRequest
Public Enumeration ExternalEventRequest
public enum class ExternalEventRequest
type ExternalEventRequest
Members
Member name | Value | Description
Accepted | 0 |  Request accepted; event was added into the event queue and will be executed momentarily.
Denied | 2 |  Request was denied due to failures of the corresponding event handler.
Pending | 1 |  Request not accepted, because the previous request is still pending (not executed).
TimedOut | 3 |  Request not accepted due to synchronization issues with other thread(s).
See Also
Reference
Autodesk.Revit.UI Namespace